CREATE TABLE `custom` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  `gender` int(11) DEFAULT NULL,
  `address` varchar(200) DEFAULT NULL,
  `phoneNumber` varchar(11) DEFAULT NULL,
  `state` int(11) NOT NULL,
  `password` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`ID`)
);

INSERT INTO `custom` VALUES
(1,'郑老板',1,'合肥','13131313131',1,'abc'),
(2,'王老板',1,'福州','12121212121',1,'abc'),
(3,'刘老板',1,'河北','15212314444',0,'abc'),
(4,'李老板',1,'江西','15212312311',1,'abc'),
(5,'吴老板',1,'黑龙江','15256530401',1,'abc'),
(6,'新增客户',0,'安徽合肥','18226666666',0,'abc'),
(7,'江老板',1,'内蒙古','15256540101',1,'abc'),
(8,'力老板',1,'西安','15653549292',1,'abc'),
(9,'桌老板',1,'新疆','16763239091',1,'abc'),
(10,'李老板',1,'广东','15256535212',1,'abc'),
(11,'马老板',0,'浙江杭州','26882626888',1,'abc'),
(12,'恶老板',1,'江苏','15656565352',1,'abc'),
(13,'贾老板',1,'浙江','1526530401',1,'abc'),
(14,'新增客户',0,'安徽省阜阳市','18226331573',1,'abc'),
(15,'吴老板',0,'福州','15256530402',1,NULL);